<template>
  <div>
    <div
      id="jumbotron"
      >
      <b-container
        class="py-5 text-light"
        >
        <b-row>
          <b-col>
            <h1
              class="text-center font-weight-bold mb-5"
              >
              {{ jumbotron_header }}
            </h1>
            <h5
              class="text-center"
              >
              {{ jumbotron_lead }}
            </h5>
          </b-col>
        </b-row>
      </b-container>
    </div>
    <b-carousel
      v-if="articles.length !== 0"
      controls
      indicators
    >
      <b-carousel-slide
        v-for="article in articles"
        :key="article.id"
        >
        <template #img>
          <img
            class="article-image"
            :src="article.image ? `${media}/${article.image}` :
            require('../assets/images/empty.png')"
            >
        </template>
        <template>
          <div class="text-dark">
            <h3
              class="mb-3"
              >
              {{ article.title }}
            </h3>
            <h5>
              {{ article.text }}
            </h5>
          </div>
        </template>
      </b-carousel-slide>
    </b-carousel>
    <div
      class="bg-light"
      >
      <b-container
        class="py-5 text-dark"
        >
        <b-row
          class="mb-5"
          >
          <b-col>
            <h2
              class="text-center font-weight-bold text-uppercase"
              >
              {{ icons_header }}
            </h2>
          </b-col>
        </b-row>
        <b-row>
          <b-col
            md="6"
            class="my-3"
            >
            <b-row>
              <b-col
                cols="3"
                >
                <b-icon
                  icon="hand-thumbs-up"
                  variant="dark"
                  font-scale="3"
                  >
                </b-icon>
              </b-col>
              <b-col
                cols="9"
                >
                {{ icons_1_text }}
              </b-col>
            </b-row>
          </b-col>
          <b-col
            md="6"
            class="my-3"
            >
            <b-row>
              <b-col
                cols="3"
                >
                <b-icon
                  icon="calendar"
                  variant="dark"
                  font-scale="3"
                  >
                </b-icon>
              </b-col>
              <b-col
                cols="9"
                >
                {{ icons_2_text }}
              </b-col>
            </b-row>
          </b-col>
          <b-col
            md="6"
            class="my-3"
            >
            <b-row>
              <b-col
                cols="3"
                >
                <b-icon
                  icon="card-checklist"
                  variant="dark"
                  font-scale="3"
                  >
                </b-icon>
              </b-col>
              <b-col
                cols="9"
                >
                {{ icons_3_text }}
              </b-col>
            </b-row>
          </b-col>
          <b-col
            md="6"
            class="my-3"
            >
            <b-row>
              <b-col
                cols="3"
                >
                <b-icon
                  icon="clock"
                  variant="dark"
                  font-scale="3"
                  >
                </b-icon>
              </b-col>
              <b-col
                cols="9"
                >
                {{ icons_4_text }}
              </b-col>
            </b-row>
          </b-col>
        </b-row>
      </b-container>
    </div>
    <b-container
      class="py-5"
      >
      <b-row>
        <b-col>
          <h2
            class="text-center font-weight-bold text-uppercase mb-5"
            >
            {{ article_header }}
          </h2>
          <div
            id="photo"
            class="mb-5"
            >
          </div>
          <p
            v-for="article_paragraph in article_text.entries()"
            :key="article_paragraph[0]"
            >
            {{ article_paragraph[1] }}
          </p>
        </b-col>
      </b-row>
    </b-container>
    <div
      class="bg-light"
      >
      <b-container
        class="py-5 text-dark"
        >
        <b-row
          align-h="around"
          class="my-5"
          >
          <b-col
            cols="3"
            >
            <h3
              class="mb-3"
              >
              {{ info_1_header }}
            </h3>
            <div>
              <b-icon
                icon="bullseye"
                variant="dark"
                font-scale="5"
                >
              </b-icon>
            </div>
          </b-col>
          <b-col
            cols="7"
            >
            <p
              v-for="info_1_paragraph in info_1_text.entries()"
              :key="info_1_paragraph[0]"
              >
              {{ info_1_paragraph[1] }}
            </p>
          </b-col>
        </b-row>
        <b-row
          align-h="around"
          class="my-5"
          >
          <b-col
            cols="3"
            >
            <h3
              class="mb-3"
              >
              {{ info_2_header }}
            </h3>
            <div>
              <b-icon
                icon="book"
                variant="dark"
                font-scale="5"
                >
              </b-icon>
            </div>
          </b-col>
          <b-col
            cols="7"
            >
            <p
              v-for="info_2_paragraph in info_2_text.entries()"
              :key="info_2_paragraph[0]"
              >
              {{ info_2_paragraph[1] }}
            </p>
          </b-col>
        </b-row>
        <b-row
          align-h="around"
          class="my-5"
          >
          <b-col
            cols="3"
            >
            <h3
              class="mb-3"
              >
              {{ info_3_header }}
            </h3>
            <div>
              <b-icon
                icon="tools"
                variant="dark"
                font-scale="5"
                >
              </b-icon>
            </div>
          </b-col>
          <b-col
            cols="7"
            >
            <p
              v-for="info_3_paragraph in info_3_text.entries()"
              :key="info_3_paragraph[0]"
              >
              {{ info_3_paragraph[1] }}
            </p>
          </b-col>
        </b-row>
        <b-row
          align-h="around"
          class="my-5"
          >
          <b-col
            cols="3"
            >
            <h3
              class="mb-3"
              >
              {{ info_4_header }}
            </h3>
            <div>
              <b-icon
                icon="table"
                variant="dark"
                font-scale="5"
                >
              </b-icon>
            </div>
          </b-col>
          <b-col
            cols="7"
            >
            <p
              v-for="info_4_paragraph in info_4_text.entries()"
              :key="info_4_paragraph[0]"
              >
              {{ info_4_paragraph[1] }}
            </p>
          </b-col>
        </b-row>
        <b-row
          align-h="around"
          class="my-5"
          >
          <b-col
            cols="3"
            >
            <h3
              class="mb-3"
              >
              {{ info_5_header }}
            </h3>
            <div>
              <b-icon
                icon="question-circle"
                variant="dark"
                font-scale="5"
                >
              </b-icon>
            </div>
          </b-col>
          <b-col
            cols="7"
            >
            <p
              v-for="info_5_paragraph in info_5_text.entries()"
              :key="info_5_paragraph[0]"
              >
              {{ info_5_paragraph[1] }}
            </p>
          </b-col>
        </b-row>
      </b-container>
    </div>
    <b-container
      class="py-5"
      >
      <b-row>
        <b-col>
          <h2
            class="text-center font-weight-bold text-uppercase mb-5"
            >
            {{ courses_header }}
          </h2>
          <b-card-group
            deck
            >
            <b-row
              align-h="start"
              >
              <b-col
                v-for="course in courses"
                :key="course.id"
                md="12"
                xl="6"
                >
                <b-card
                  :img-src="`${media}/${course.image}`"
                  img-top
                  class="course mx-auto"
                  >
                  <b-card-body>
                    <b-card-title>
                      <span
                        v-if="course.soon"
                        >
                        {{ course.title }}
                      </span>
                      <b-link
                        v-else
                        :to="{ name: 'course', params: { id: course.id } }"
                        >
                        {{ course.title }}
                      </b-link>
                      <b-badge
                        v-if="course.purchased"
                        >
                        {{ purchased_badge }}
                      </b-badge>
                      <b-badge
                        v-if="course.soon"
                        >
                        {{ soon_badge }}
                      </b-badge>
                    </b-card-title>
                    <b-card-text>
                      <div
                        class="mb-3"
                        >
                        {{ course.shortDescription }}
                      </div>
                      <div
                        v-if="!(course.purchased || course.soon)"
                        >
                        <course-purchase-button
                          :id="course.id"
                          >
                        </course-purchase-button>
                      </div>
                    </b-card-text>
                  </b-card-body>
                </b-card>
              </b-col>
            </b-row>
          </b-card-group>
        </b-col>
      </b-row>
    </b-container>
    <b-container
      class="py-5"
      >
      <b-row
        align-h="center"
        >
        <b-col
          cols="8"
          >
          <h5>
            {{ zsu_text }}
          </h5>
        </b-col>
        <b-col
          cols="2"
          >
          <b-img
            height="50"
            :src="require('../assets/images/flag.png')"
            >
          </b-img>
        </b-col>
        <b-col
          cols="1"
          >
          <b-img
            height="50"
            :src="require('../assets/images/emblem.png')"
            >
          </b-img>
        </b-col>
      </b-row>
    </b-container>
  </div>
</template>

<script>
import gql from 'graphql-tag';
import CoursePurchaseButton from './CoursePurchaseButton.vue';
import environment from '../environment';

export default {
  components: {
    CoursePurchaseButton,
  },
  data() {
    return {
      articles: [],
      courses: [],
      language: 'uk',
      media: environment.media,
    };
  },
  computed: {
    jumbotron_header() {
      return this.language === 'ru' ? 'Analytics Academy - ваш маяк в мире аналитики' : 'Analytics Academy – ваш маяк у світі аналітики';
    },
    jumbotron_lead() {
      return this.language === 'ru' ? 'Понятные курсы, простым языком от профессионалов для новичков, которые хотят обрабатывать данные быстрее, проще и качественнее' : 'Зрозумілі курси, простою мовою від професіоналів для новачків, які хочуть обробляти дані швидше, простіше та якісніше';
    },
    icons_header() {
      return this.language === 'ru' ? 'Почему мы?' : 'Чому ми?';
    },
    icons_1_text() {
      return this.language === 'ru' ? 'Десятки проведённых тренингов' : 'Десятки проведених тренінгів';
    },
    icons_2_text() {
      return this.language === 'ru' ? 'Более 20 лет опыта в реальном бизнесе' : 'Понад 20 років досвіду у реальному бізнесі';
    },
    icons_3_text() {
      return this.language === 'ru' ? 'Более 15 реализованных проектов' : 'Понад 15 реалізованих проектів';
    },
    icons_4_text() {
      return this.language === 'ru' ? 'Круглосуточная поддержка' : 'Цілодобова підтримка';
    },
    article_header() {
      return this.language === 'ru' ? 'От основателя проекта и автора курсов' : 'Від засновника проекту та автора курсів';
    },
    article_text() {
      return this.language === 'ru' ? [
        `
          Всем привет!
        `,
        `
          Я Алексей. Уже 24 (двадцать четыре года) я работаю в реальном бизнесе. Половину жизни. Начинал свой путь специалистом по продажам в 1997 и дошёл до должности директора по развитию продаж в крупной международной компании. Все эти годы я работал в реальном бизнесе. В бизнесе с реальными задачами, с реальными целями и реальными цифрами. В бизнесе, где зарплату платят потребители, покупающие товар в торговых точках. В бизнесе, где ежедневно необходимо отвечать на вопросы руководителей, готовить необходимую для принятия своевременных решений аналитику. В бизнесе, где цена каждого своевременно принятого решения чрезвычайно высока. Не зря самый известный автомобильный ТОП-менеджер США Лидо Энтони «Ли» Якокка (1924-2019) говорил: «Правильное решение, принятое с опозданием, является ошибкой». В реальном бизнесе ведь нет волшебной кнопки «Назад» или «Отмена». Везде мне приходилось отвечать за свои цифры, за свои выводы, за свои слова. И не только за свои. За слова, за цифры, за выводы своих подчиненных также.  Ведь на базе выводов аналитиков принимались и принимаются важные для бизнеса решения. Решения, от которых зависит благосостояние Компании.
        `,
        `
          Из этих 24 лет я практически 20 лет занимаюсь анализом данных. С самого первого года 21 века. Не в теории. На практике. За долгие годы мне приходилось участвовать во многих проектах Компаний, где мне выпала честь работать – ведь везде нужны не только цифры, но и их понимание. Правильное понимание.
        `,
        `
          Для кого создан этот проект? Для тех, кто устал от тренеров-теоретиков, далеких от реального бизнеса. Для тех, кто знает, что ему есть чему учиться. Для тех, кто хочет учиться. Кому не жалко для этого, в первую очередь, времени (которое, к сожалению, за деньги не купишь). Кто хочет быть эффективнее в своей ежедневной работе. Эффективнее – значит дороже. Именно так. Чем эффективнее и профессиональнее специалист – тем он дороже стоит на рынке труда. Только так.
        `,
        `
          В наших курсах вы найдете только самое необходимое. Я на 100% уверен, что в наших курсах вы получите только знания, которые вы гарантировано будете использовать в своей работе. Знания, которые Вам помогут подняться на совершенно другой уровень. Я знаю это точно. И отвечаю за свои слова.
        `,
        `
          Уже очень давно, в далеком уже 1988 году я начинал свой трудовой путь на одном из запорожских заводов, где работал фрезеровщиком 3-го разряда. Это еще были времена СССР – везде было много плакатов и транспарантов. Многие несли чистую идеологию. Но я до сих пор помню тот плакат, который висел в нашем цехе №12. Я на всю жизнь запомнил слова, которые на нем были написаны. «Почётен мастер, достигший вершины мастерства, но трижды почётен тот, кто помог взойти на эту вершину своим ученикам». Именно так. Я бы хотел, чтобы вы стали моими учениками. С Excel я начал работать еще в прошлом веке, в 1999 году. Намного позже освоил другие инструменты для анализа данных и бизнес-аналитики. Мне есть, чему Вас научить. Дать не только знания, но и то, как и для чего эти знания использовать в реальной работе. Потому, что этим я занимаюсь уже 24 года.  Так вот, я трижды будут рад, если через какое-то время я смогу научиться чему-то у вас.
        `,
        `
          И так, если вы решились – добро пожаловать и в добрый путь! Впереди нас ждем очень много интересного и полезного - ведь проект только начинается.
        `,
      ] : [
        `
          Всім привіт!
        `,
        `
          Я Олексій. Вже 24 (двадцять чотири роки) я працюю у реальному бізнесі. Половину життя. Починав свій шлях спеціалістом з продажу у 1997 році і дійшов до посади директора з розвитку продажів у великій міжнародній компанії. Усі ці роки я працював у реальному бізнесі. У бізнесі з реальними завданнями, з реальними цілями та реальними цифрами. У бізнесі, де зарплату платять споживачі, які купують товар у торгових точках. У бізнесі, де щодня необхідно відповідати на запитання керівників, готувати необхідну для ухвалення своєчасних рішень аналітику. У бізнесі, де ціна кожного своєчасно прийнятого рішення є надзвичайно високою. Не дарма найвідоміший автомобільний ТОП-менеджер США Лідо Ентоні «Лі» Якокка (1924-2019) говорив: «Правильне рішення, ухвалене із запізненням, є помилкою». Адже в реальному бізнесі немає чарівної кнопки «Назад» або «Скасування». Всюди мені доводилося відповідати за свої цифри, за свої висновки, за свої слова. І не лише за свої. За слова, за цифри, за висновки своїх підлеглих також. Адже на базі висновків аналітиків приймалися і ухвалюються важливі для бізнесу рішення. Рішення, від яких залежить добробут Компанії.
        `,
        `
          З цих 24 років я майже 20 років займаюся аналізом даних. З першого року 21 століття. Не теоретично. На практиці. За довгі роки мені доводилося брати участь у багатьох проектах Компаній, де мені випала честь працювати – адже скрізь потрібні не лише цифри, а й їхнє розуміння. Правильне розуміння.
        `,
        `
          Для кого створено цей проект? Для тих хто втомився від тренерів-теоретиків, далеких від реального бізнесу. Для тих, хто знає, що йому є чому вчитися. Для тих, хто бажає вчитися. Кому не шкода для цього насамперед часу (який, на жаль, за гроші не купиш). Хто хоче бути ефективнішим у своїй щоденній роботі. Ефективніше – значить дорожче. Саме так. Чим ефективніший і більш професійний спеціаліст – тим він дорожче коштує на ринку праці. Тільки так.
        `,
        `
          У наших курсах ви знайдете лише найнеобхідніше. Я на 100% впевнений, що в наших курсах ви отримаєте лише знання, які ви гарантовано використовуватимете у своїй роботі. Знання, які допоможуть Вам піднятися на зовсім інший рівень. Я це знаю точно. І відповідаю за свої слова.
        `,
        `
          Вже дуже давно, у далекому вже 1988 році я розпочинав свій трудовий шлях на одному із запорізьких заводів, де працював фрезерувальником 3-го розряду. Це ще були часи СРСР – скрізь було багато плакатів та транспарантів. Багато хто ніс чисту ідеологію. Але я й досі пам'ятаю той плакат, який висів у нашому цеху №12. Я на все життя запам'ятав слова, написані на ньому. "Почесний майстер, який досяг вершини майстерності, але тричі почесний той, хто допоміг зійти на цю вершину своїм учням". Саме так. Я хотів би, щоб ви стали моїми учнями. З Excel я почав працювати ще в минулому столітті, 1999 року. Набагато пізніше освоїв інші інструменти для аналізу даних та бізнес-аналітики. Мені є, чого Вас навчити. Дати як знання, а й те, як і навіщо ці знання використовувати у реальній роботі. Тому що цим я займаюся вже 24 роки. Так ось, я тричі буду радий, якщо через якийсь час я зможу навчитися чогось у вас.
        `,
        `
          І так, якщо ви наважилися - ласкаво просимо і в добрий шлях! Попереду на нас чекає дуже багато цікавого та корисного – адже проект тільки починається.
        `,
      ];
    },
    courses_header() {
      return this.language === 'ru' ? 'Курсы' : 'Курси';
    },
    purchased_badge() {
      return this.language === 'ru' ? 'Куплено' : 'Куплено';
    },
    soon_badge() {
      return this.language === 'ru' ? 'Скоро' : 'Незабаром';
    },
    info_1_header() {
      return this.language === 'ru' ? 'Наша миссия' : 'Наша місія';
    },
    info_1_text() {
      return this.language === 'ru' ? [
        `
          Средняя зарплата аналитика в Украине – около 27 тысяч гривень. При этом многие Компании готовы платить аналитикам и в два раза больше средней зарплаты! Мы уверены, что Вы хотите зарабатывать максимум. Думаете это нереально? Мы убедим Вас в обратном!
        `,
        `
          Наша Миссия – дать Вам столько знаний и навыков, чтобы Вы зарабатывали намного больше.
        `,
        `
          Все просто – от нас знания, от Вас – желание их постигать!
        `,
      ] : [
        `
          Середня зарплата аналітика в Україні – близько 27 тисяч гривень. При цьому багато компаній готові платити аналітикам і вдвічі більше середньої зарплати! Ми впевнені, що Ви бажаєте заробляти максимум. Думаєте це неможливо? Ми переконаємо Вас у зворотному!
        `,
        `
          Наша Місія – дати Вам стільки знань та навичок, щоб Ви заробляли набагато більше.
        `,
        `
          Все просто – від нас знання, від Вас – бажання їх осягати!
        `,
      ];
    },
    info_2_header() {
      return this.language === 'ru' ? 'Чему научим?' : 'Чого навчимо?';
    },
    info_2_text() {
      return this.language === 'ru' ? [
        `
          Количество цифровой информации в мире удваивается каждые 3.5 года. При этом объем данных растет в 4 (четыре) раза быстрее, чем растет мировая экономика.
        `,
        `
          При этом требуется все более быстрая скорость их обработки – просто потому, что от этого зависит быстрота принятия решений на всех уровнях, а значит и успешность любой Компании.
        `,
        `
          Мы научим Вас работать с данными. Научим обрабатывать их быстро и эффективно. Поделимся с Вами своим, более чем 20 летним опытом. Расскажем и научим. Это не просто знание формул, графиков, диаграмм, элементов визуализации и тд. Цель анализа данных – найти, нет не проблемы. Найти области для улучшения, потенциал роста. Для этого нужно быстро обработать данные, найти ключевые цифры, сделать на основании них выводы и презентовать эти цифры и выводы в своей Компании. Все это мы будем Вам доносить в наших тренингах.  Как в шахматах – для того, чтобы уметь играть в шахматы мало просто знать, как ходят фигуры.
        `,
      ] : [
        `
          Кількість цифрової інформації у світі подвоюється кожні 3,5 року. При цьому обсяг даних зростає у 4 (чотири) рази швидше, ніж зростає світова економіка.
        `,
        `
          При цьому потрібна швидкість їх обробки ще швидша– просто тому, що від цього залежить швидкість прийняття рішень на всіх рівнях, а значить, і успішність будь-якої Компанії.
        `,
        `
          Ми навчимо Вас працювати з даними. Навчимо обробляти їх швидко та ефективно. Поділимося з Вами своїм, більш ніж 20-річним досвідом. Розкажемо та навчимо. Це не просто знання формул, графіків, діаграм, елементів візуалізації тощо. Мета аналізу даних – знайти проблеми? Ні! Знайти області для покращення, потенціал зростання. Для цього потрібно швидко опрацювати дані, знайти ключові цифри, зробити на основі них висновки та презентувати ці цифри та висновки у своїй Компанії. Все це ми Вам доноситимемо в наших тренінгах. Як у шахах – для того, щоб уміти грати у шахи мало просто знати, як ходять фігури.
        `,
      ];
    },
    info_3_header() {
      return this.language === 'ru' ? 'Где нужны знания, которые мы Вам дадим?' : 'Де потрібні знання, які ми дамо Вам?';
    },
    info_3_text() {
      return this.language === 'ru' ? [
        `
          20 лет назад аналитика только зарождалась. Многие решения вплоть до 2005-2007 годов принимались на уровне интуиции (и не без успеха!).
        `,
        `
          Сейчас ситуация изменилась кардинально. Сейчас специалист, который умеет быстро и эффективно обработать данные, «раскопать» в них ключевые цифры, сделать выводы и грамотно их предоставить в визуальном виде а также разработать аналитические отчеты так, чтобы пользователи могли бы с ними работать и самостоятельно – будет ценен в любой Компании. И не важно, какой профиль бизнеса – огромное количество данных есть во всех Компаниях. Дерзайте – и у Вас все получится! Мы Вам поможем. Для этого и создан наш проект.
        `,
      ] : [
        `
          20 років тому аналітика лише зароджувалася. Багато рішень аж до 2005-2007 років ухвалювалися на рівні інтуїції (і не без успіху!).
        `,
        `
          Наразі ситуація змінилася кардинально. Зараз фахівець, який вміє швидко та ефективно обробити дані, «розкопати» в них ключові цифри, зробити висновки та коректно їх надати у візуальному вигляді, а також розробити аналітичні звіти так, щоб користувачі могли б з ними працювати самостійно – буде цінний у будь-якій Компанії. І не важливо, який профіль бізнесу – величезна кількість даних є у всіх компаніях. Дерзайте - і у Вас все вийде! Ми допоможемо Вам. Для цього і створено наш проект.
        `,
      ];
    },
    info_4_header() {
      return this.language === 'ru' ? 'Почему важно начать изучать инструменты аналитики?' : 'Чому важливо вивчати інструменти аналітики?';
    },
    info_4_text() {
      return this.language === 'ru' ? [
        `
          Продукты Корпорации «Microsoft» для работы с данными - Excel, PowerBI, PowerPivot, а также язык DAX и другие продукты обязан знать и владеть в совершенстве любой специалист, который планирует работать с данными и стать Аналитиком (именно так, с большой буквы).
        `,
        `
          Многие даже не подозревают о том, насколько мощные и огромные возможности предоставляются тому, кто ими овладеет в совершенстве.
        `,
        `
          В этом Вы гарантировано убедитесь сами, когда окунетесь в удивительный мир новых для Вас знаний вместе с нами!
        `,
      ] : [
        `
          Продукти Корпорації Microsoft для роботи з даними - Excel, PowerBI, PowerPivot, а також мова DAX та інші продукти зобов'язаний знати і досконало володіти будь-який фахівець, який планує працювати з даними та стати Аналітиком (саме так, з великої літери).
        `,
        `
          Багато хто навіть не підозрює про те, наскільки потужні та величезні можливості надаються тому, хто ними опанує досконало.
        `,
        `
          У цьому Ви гарантовано переконаєтеся самі, коли поринете у дивовижний світ нових для Вас знань разом із нами!
        `,
      ];
    },
    info_5_header() {
      return this.language === 'ru' ? 'Кому подойдет этот курс?' : 'Кому підійде цей курс?';
    },
    info_5_text() {
      return this.language === 'ru' ? [
        `
          Наверное, проще сказать, кому он не подойдет, но мы не будем этот список озвучивать!
        `,
        `
          Почти в любой Компании с данными работают ежедневно и ежечасно абсолютное большинство офисных сотрудников, да и не только офисных.
        `,
        `
          В первую очередь курс адресован тем, кто понимает, что его знания недостаточные для эффективной работы и хочет их совершенствовать.
        `,
        `
          А еще он для тех, кто хочет 10% времени тратить на обработку данных, а 90% на их анализ и выводы. Очень у многих сейчас время распределяется ровно наоборот.
        `,
        `
          Вообще не важно -  вы только сделали первые шаги в аналитике, или считаете себя уверенным пользователем – Вы найдете в наших курсах много нового и полезного. Нужно просто найти время и желание!
        `,
      ] : [
        `
          Напевно, простіше сказати, кому він не підійде, але ми не озвучуватимемо цей список!
        `,
        `
          Майже в будь-якій Компанії з даними працюють щодня та щогодини абсолютна більшість офісних співробітників, та й не тільки офісних.
        `,
        `
          Насамперед курс адресований тим, хто розуміє, що його знання недостатні для ефективної роботи та хоче їх удосконалювати.
        `,
        `
          А ще він для тих, хто хоче 10% часу витрачати на обробку даних, а 90% на їхній аналіз та висновки. Дуже у багатьох зараз час розподіляється навпаки.
        `,
        `
          Взагалі не важливо – Ви тільки зробили перші кроки в аналітиці, або вважаєте себе впевненим користувачем – Ви знайдете в наших курсах багато нового та корисного. Потрібно просто знайти час та бажання!
        `,
      ];
    },
    zsu_text() {
      return this.language === 'ru' ? 'На период военного положения 50% средств вырученных с продажи курсов будут перечисляться на нужды ЗСУ' : 'На період військового стану 50% коштів виручених з продажу курсів перераховуватимуться на потреби ЗСУ';
    },
  },
  apollo: {
    articles: gql`
      query {
        articles {
          id
          title
          image
          text
        }
      }
    `,
    courses: gql`
      query {
        courses {
          id
          soon
          title
          image
          shortDescription
          purchased
        }
      }
    `,
    language: gql`
      query {
        language
      }
    `,
  },
};
</script>

<style lang="scss" scoped>
#jumbotron {
  background-image: linear-gradient(rgba(0, 0, 0, 0.5), rgba(0, 0, 0, 0.5)), url('../assets/images/jumbotron.jpg');
  background-repeat: no-repeat;
  background-size: cover;
  background-position: top center;
}
#photo {
  background-image: url('../assets/images/photo.jpg');
  background-repeat: no-repeat;
  background-size: cover;
  background-position: center center;
  height: 35vw;
}
.course {
  max-width: 40em;
}
.article-image {
  height: 30vw;
}
</style>
