<template>
  <b-container
    class="py-3"
    >
    <b-row>
      <b-col>
        <h2
          class="text-center mb-5"
          >
          {{ privacy_policy_header }}
        </h2>
        <p
          v-for="privacy_policy_paragraph in privacy_policy_text.entries()"
          :key="privacy_policy_paragraph[0]"
          >
          {{ privacy_policy_paragraph[1] }}
        </p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
import gql from 'graphql-tag';

export default {
  data() {
    return {
      language: 'uk',
    };
  },
  computed: {
    privacy_policy_header() {
      return this.language === 'ru' ? 'Политика конфиденциальности' : 'Політика конфіденційності';
    },
    privacy_policy_text() {
      return this.language === 'ru' ? [
        `
          Мы высоко ценим конфиденциальность личной информации наших пользователей. Используя в работе с Интернет-ресурсами все доступные возможности сети, вы можете быть насчёт абсолютно спокойны сохранности личной информации.
        `,
        `
          Данные, которые пользователи предоставляют при заполнении Заявки-анкеты или во время других манипуляций, применяются только в обусловленных ниже случаях. Преимущественно, личная информация используется в целях подготовки специальных Продуктов и Услуг.
        `,
        `
          Данные, необходимые для сайта
        `,
        `
          Необходимые для сервиса данные - то те пункты, которые заполняются в Заявке -анкете, а именно Имя, Телефон и E-mail. Таким образом, пользователь добровольно соглашается на получение писем.
        `,
        `
          Цель сбора личной информации
        `,
        `
          Единственное для чего используется информация о пользователе — это связь с ним администратора посредством телефона для уточнения деталей регистрации и отправка ему на электронную почту писем рассылки. Имя, которое указывается в регистрационной форме, необходимо для личного обращения. В письме от компании вы будете получать информацию о Курсах, интересных фактах и предложениях.
        `,
        `
          Вся предоставленная информация не передается третьим лицам. Исключением из правила может быть только исполнение требований законодательства. Личные данные пользователей хранятся в базе данных нашей CRM, где вся информация защищена и может использоваться только в указанных в данной политике конфиденциальности случаях.
        `,
        `
          За пользователем остается право отказаться от рассылки. Тогда его имя и электронный адрес будет автоматически удален из базы данных. Для этого достаточно всего одного клика мыши на соответствующем пункте, который есть в каждом полученном письме.
        `,
        `
          Как происходит использование личных данных
        `,
        `
          Сайт https://analytics-academy.com.ua использует Cookies.
        `,
        `
          С их помощью происходит сбор данных о перемещениях посетителей по сайту. Такой контроль дает возможность улучшать и совершенствовать работу ресурса. Данный подход позволяет лучше ориентироваться на предпочтения посетителей и создавать интересующий пользователей контент.
        `,
        `
          В настройках каждого браузера можно запретить отправку Cookies или указать необходимость подтверждения каждой отправки. Эти действия, конечно, сохранят вас от распространения информации о ваших перемещениях в сети, но при этом некоторые сайты и возможности будут недоступны.
        `,
        `
          Защита персональных данных
        `,
        `
          Для обеспечения конфиденциальности информации о пользователях мы применяем различные меры безопасности, в том числе административные, управленческие и технические. Соответственно с международными стандартами контроля, мы не только собираем данные, но и несем полную ответственность за их сохранность. Каждый сотрудник нашей компании осознает всю важность соблюдения необходимых мер контроля, а также норм и указаний, принятыми в Соглашении.
        `,
        `
          Но, несмотря на высокие уровень обеспечения сохранности ваших персональных данных, пользователю тоже необходимо придерживаться определенных правил. Работая в Интернете, будьте осторожны и не распространяйте свои личные данные.
        `,
        `
          Наши разработчики делают все возможное, чтобы предотвратить возможность утечки информации, необоснованного использования и изменения персональных данных. Но 100% гарантии не может предоставить ни один интернет-сервис, так как от незаконного взлома системы не застрахован никто. Хакерская атака может создать условия для получения данных другими людьми.
        `,
        `
          Если определенные пункты политики конфиденциальности буду меняться, то все пользователи получат извещения о данных переменах на свою электронную почту. Для выяснения каких-нибудь вопросов непосредственно с администрацией сайта, можно отправить письмо по адресу analytics.academy.2021@gmail.com
        `,
      ] : [
        `
          Ми цінуємо конфіденційність особистої інформації наших користувачів. Використовуючи в роботі з Інтернет-ресурсами всі доступні можливості мережі, ви можете бути абсолютно спокійними для збереження особистої інформації.
        `,
        `
          Дані, які користувачі надають під час заповнення Заявки-анкети або під час інших маніпуляцій, застосовуються лише в таких випадках. Переважно особиста інформація використовується з метою підготовки спеціальних Продуктів та Послуг.
        `,
        `
          Дані, необхідні для сайту
        `,
        `
          Необхідні для сервісу дані - то пункти, які заповнюються в Заявці-анкеті, а саме Ім'я, Телефон та E-mail. Таким чином, користувач добровільно погоджується отримання листів.
        `,
        `
          Ціль збору особистої інформації
        `,
        `
          Єдине для чого використовується інформація про користувача – це зв'язок з ним адміністратора за допомогою телефону для уточнення деталей реєстрації та надсилання йому на електронну пошту листів розсилки. Ім'я, яке вказується у реєстраційній формі, необхідне для особистого звернення. У листі від компанії ви отримуватимете інформацію про Курси, цікаві факти та пропозиції.
        `,
        `
          Вся надана інформація не передається третім особам. Винятком із правила може лише виконання вимог законодавства. Особисті дані користувачів зберігаються в базі даних нашої CRM, де вся інформація захищена і може використовуватися лише у зазначених у цій політиці конфіденційності випадках.
        `,
        `
          За користувачем залишається право відмовитись від розсилки. Тоді його ім'я та електронну адресу буде автоматично видалено з бази даних. Для цього достатньо лише одного кліку миші на відповідному пункті, який є у кожному отриманому листі.
        `,
        `
          Як відбувається використання особистих даних
        `,
        `
          Сайт https://analytics-academy.com.ua використовує Cookies.
        `,
        `
          З їхньою допомогою відбувається збір даних про переміщення відвідувачів по сайту. Такий контроль дає можливість покращувати та вдосконалювати роботу ресурсу. Даний підхід дозволяє краще орієнтуватися на переваги відвідувачів і створювати цікавий для користувачів контент.
        `,
        `
          У налаштуваннях кожного браузера можна заборонити надсилання Cookies або вказати на необхідність підтвердження кожної відправки. Ці дії, звичайно, збережуть вас від поширення інформації про ваші переміщення в мережі, але деякі сайти і можливості будуть недоступні.
        `,
        `
          Захист персональних даних
        `,
        `
          Для забезпечення конфіденційності інформації про користувачів ми вживаємо різноманітних заходів безпеки, у тому числі адміністративних, управлінських та технічних. Відповідно до міжнародних стандартів контролю, ми не тільки збираємо дані, але й несемо повну відповідальність за їх збереження. Кожен співробітник нашої компанії усвідомлює всю важливість дотримання необхідних заходів контролю, а також норм та вказівок, ухвалених у Угоді.
        `,
        `
          Але, незважаючи на високі рівень забезпечення збереження ваших персональних даних, користувачеві також необхідно дотримуватися певних правил. Працюючи в Інтернеті, будьте обережні та не розповсюджуйте свої особисті дані.
        `,
        `
          Наші розробники роблять все можливе, щоб запобігти можливості витоку інформації, необґрунтованого використання та зміни персональних даних. Але 100% гарантії не може надати жоден інтернет-сервіс, оскільки від незаконного злому системи не застраховано ніхто. Хакерська атака може створити умови отримання даних іншими людьми.
        `,
        `
          Якщо певні пункти політики конфіденційності змінюватимуться, то всі користувачі отримають повідомлення про ці зміни на свою електронну пошту. Для з'ясування будь-яких питань безпосередньо з адміністрацією сайту, можна надіслати листа на адресу analytics.academy.2021@gmail.com
        `,
      ];
    },
  },
  apollo: {
    language: gql`
      query {
        language
      }
    `,
  },
};
</script>
