<template>
  <b-container
    class="py-3"
    >
    <b-row>
      <b-col>
        <h2
          class="text-center mb-5"
          >
          {{ public_offer_header }}
        </h2>
        <p
          v-for="public_offer_paragraph in public_offer_text.entries()"
          :key="public_offer_paragraph[0]"
          >
          {{ public_offer_paragraph[1] }}
        </p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
import gql from 'graphql-tag';

export default {
  data() {
    return {
      language: 'uk',
    };
  },
  computed: {
    public_offer_header() {
      return this.language === 'ru' ? 'Публичная оферта' : 'Публічна оферта';
    },
    public_offer_text() {
      return this.language === 'ru' ? [
        `
          ДОГОВОР ОФЕРТЫ
        `,
        `
          Публичный договор (оферта)
        `,
        `
          Настоящая оферта адресована любому лицу (неопределенному кругу лиц) (далее «Заказчик») и является публичным предложением Исполнителя заключить договор об оказании услуг, размещенный в сети Интернет по адресу analytics-academy.com.ua и может отправляться на электронную почту Заказчика (далее Договор) на следующих условиях:
        `,
        `
          1.ОПРЕДЕЛЕНИЕ ТЕРМИНОВ
        `,
        `
          Для целей этого Договора термины употребляются в таком значении:
        `,
        `
          1.1. Акцепт – полное, безусловное и безоговорочное принятие Заказчиком условий настоящего Договора без каких-либо исключений и/или ограничений и является равносильным заключению двухстороннего письменного Договора.
        `,
        `
          1.2. Заказчик – лицо, которое совершило Акцепт условий настоящего Договора и становится Заказчиком услуг Исполнителя по заключенному договору. Заказчиком может быть любое дееспособное физическое лицо, достигшее 18 лет, которое намерено получить услуги Исполнителя в порядке и на условиях, определенных настоящим Договором.
        `,
        `
          1.3. Исполнитель — ФОП Фокина Илона Владимировна. Наименование Исполнителя указывается в счете или иных документах на оплату Услуг.
        `,
        `
          1.4. Услуга – деятельность Исполнителя, связанная с оказанием услуг по обучению населения на курсах, путем предоставления доступа Заказчиков к отдельным разделам (Курсам) Сайта Исполнителя и предоставлению ссылки на скачивание раздаточных материалов выбранного курса. Описание Курсов, их стоимость доступны на Сайте Исполнителя: analytics-academy.com.ua.
        `,
        `
          1.5. Курс — целостная сформированная совокупность оффлайн  занятий, электронных версий аудио-, видеозаписей занятий, курсов,  текстовых, аудиовизуальных произведений, связанных между собой и структурированных на определенную тему, защищенных законодательством Украины в сфере интеллектуальной собственности, доступ к которым предоставляется через Сайт или Веб-страницу для использования Заказчиком.
        `,
        `
          1.6. Сайт — совокупность данных, электронной (цифровой) информации, других объектов авторского права и (или) смежных прав и т.п., связанных между собой и структурированных в пределах адреса analytics-academy.com.ua, доступ к которым осуществляется через указанный адрес сети Интернет.
        `,
        `
          1.7. Персональная ссылка — персональная формализированная в соответствии со стандартами сети Интернет запись адреса сайта или его части (Веб-страницы), что позволяет Заказчику получить доступ к Сайту в сети Интернет.
        `,
        `
          2. ОСНОВНЫЕ ПОЛОЖЕНИЯ
        `,
        `
          2.1. Договор заключается между Исполнителем и Заказчиком услуг в форме договора присоединения. Договор публичной оферты является публичным, то есть в соответствии со статьями 633, 641 Гражданского кодекса Украины его условия одинаковы для всех Заказчиков независимо от статуса (физическое лицо, юридическое лицо, физическое лицо - предприниматель) и резидентства. При полном согласии с данным Договором, Заказчик принимает условия, порядок оплаты и предоставления услуг Исполнителем, ответственности за невыполнение условий настоящего Договора.
        `,
        `
          2.2. Настоящий Договор является публичным договором (далее именуется — Договор), который считается заключенным между Исполнителем, с одной стороны, Заказчиком, с другой, с момента Акцепта последним всех без исключения условий и положений настоящего Договора.
        `,
        `
          2.3. В порядке и на условиях, определенных настоящим Договором, Исполнитель обязуется предоставить Заказчику услуги, а Заказчик обязуется принять и оплатить оказанные Услуги.
        `,
        `
          2.4. Действиями, свидетельствующими о согласии соблюдать условия этого Договора, является Акцепт Заказчиком условий настоящего Договора.
        `,
        `
          2.5. Заказчик осуществляет акцепт Договора после ознакомления с его условиями, размещенными на Сайте путем совокупного или отдельного выполнения любого из следующих действий:
        `,
        `
          2.5.1. Заполнение Заказчиком заявки-анкеты с выбором курса;
        `,
        `
          2.5.2. Оплаты Заказчиком услуги в полном объеме;
        `,
        `
          2.5.3. Проставления соответствующей отметки «Я согласен(-на) с политикой конфиденциальности и принимаю публичный договор оферты».
        `,
        `
          2.6. Перечень и стоимость предоставления Услуг размещены на Сайте.
        `,
        `
          3. СТОИМОСТЬ УСЛУГ И ПОРЯДОК РАСЧЕТОВ
        `,
        `
          3.1. Стоимость Услуг зависит от выбранных Курсов и указывается на Сайте Исполнителя. По желанию Заказчика ему может быть выставлен счет на оплату услуг.
        `,
        `
          3.2. Исполнитель вправе в одностороннем порядке изменить стоимость Услуг до момента оплаты путем публикации новой цены на Сайте.
        `,
        `
          3.3. Заказчик осуществляет оплату услуг на условиях 100% предоплаты.
        `,
        `
          3.4. Оплата Услуг Исполнителем означает ознакомление и полное согласие Заказчика с условиями настоящего Договора.
        `,
        `
          3.5. Оплата Услуг осуществляется путем перечисления денежных средств на текущий счет Исполнителя.
        `,
        `
          3.6. Услуга считается оплаченной с момента зачисления средств на текущий счет Исполнителя.
        `,
        `
          4. УСЛОВИЯ ОКАЗАНИЯ УСЛУГ
        `,
        `
          4.1. Для получения услуг Исполнителя Заказчик выбирает на сайте заинтересовавший его курс, нажав кнопку «Купить», Заказчик перенаправляется в платежную систему Liq Pay, где оплачивается услугу по реквизитам Исполнителя.
        `,
        `
          4.4. После получения оплаты Исполнителем Заказчику автоматически открывается доступ к урокам и предоставляется ссылка на скачивание раздаточных материалов выбранного курса. При получении доступа ко всем урокам курса, услуга считается оказанной.
        `,
        `
          4.5. В случае неполучения Заказчиком доступа, Заказчик должен обратиться в службу поддержки Исполнителя путем направления письма на электронную почту: analytics.academy.2021@gmail.com
        `,
        `
          4.6. Персональный доступ действителен для одного Заказчика. Запрещается передача доступа третьим лицам.
        `,
        `
          4.7. Для получения Услуги Заказчик самостоятельно обеспечивает соблюдение надлежащих технических условий для персонального компьютера или другого мобильного устройства.
        `,
        `
          4.8. Использование Заказчиком полученных информации и материалов (аудио-, видеозаписей и т.п.) допускается только в личных целях и для личного использования.
        `,
        `
          4.9. Исполнитель вправе отказаться от предоставления услуг в одностороннем порядке и аннулировать доступ Заказчика к выбранной программы в случае установления фактов передачи Заказчиком доступа третьим лицам, распространения информации и материалов (аудио, видео и т.д.), полученных в результате получения Услуг, третьим лицам.
        `,
        `
          5. ПРАВА И ОБЯЗАННОСТИ ЗАКАЗЧИКА
        `,
        `
          Заказчик имеет право:
        `,
        `
          5.1. Получить Услуги на условиях настоящего Договора.
        `,
        `
          5.2. Получить от Исполнителя информацию о предоставляемых Услугах, условиях их предоставления по телефонам, указанным на Сайте, или направив соответствующий запрос на электронную почту, указанную на Сайте.
        `,
        `
          5.3. Входить на канал под своей учетной записью одновременно только с одной точки доступа (персональный компьютер, ноутбук, нетбук, планшет и др.).
        `,
        `
          5.4. Заказчик пользуется всеми правами потребителя в соответствии с действующим законодательством Украины, регулирующего данные правоотношения.
        `,
        `
          Заказчик обязуется:
        `,
        `
          5.5. Оплатить Услуги в полном объеме в порядке и сроки, предусмотренные настоящим Договором.
        `,
        `
          5.6. Предоставить достоверную информацию о себе в процессе заполнения заявки на приобретения Курса. Заказчик несет ответственность за достоверность такой информации.
        `,
        `
          5.7. Поддерживать в исправном техническом состоянии оборудования и каналы связи, обеспечивающие доступ к Сайту.
        `,
        `
          5.8. Выполнять рекомендации, домашние задания, требования и т.п. Исполнителя, изложенные в соответствующем Курсе.
        `,
        `
          5.9. Предоставить Исполнителю актуальную информацию о средствах связи для направления информационных материалов, а также для связи Исполнителя с Заказчиком в рамках оказания Услуг, согласно настоящему Договору.
        `,
        `
          Заказчику запрещается:
        `,
        `
          5.10. Осуществлять в любой форме запись (путем аудио-, видеозаписи, скачивания, скриншоты, фотографирование и других способов хранения информации) Курса, проводимого в рамках оказания Услуг по настоящему Договору.
        `,
        `
          5.11. Копировать, распространять любым способом аудио-, видео-, информационные материалы курса, полученные в рамках настоящего Договора.
        `,
        `
          5.12. Распространять материалы, полученные в рамках указанного Договора путем расшифровки (перевода аудио- и видеоматериалов в текстовый формат) или перевода на другие языки.
        `,
        `
          5.13. Использовать полученную в рамках настоящего Договора информацию, материалы в коммерческих целях путем пересказывания или распространение в любых способ полученных от Исполнителя знаний.
        `,
        `
          5.14. Использовать полученную от Исполнителя информацию, включая (без ограничения) с целью создания подобной и/или конкурентной услуги или сервиса, или с целью получения коммерческой или финансовой выгоды без предварительного согласования с Исполнителем.
        `,
        `
          5.15. Осуществлять свою деятельность на основе Услуг Исполнителя.
        `,
        `
          5.16. Допускать распространение недостоверной, ложной информации, информации, порочащей честь, достоинство, деловую репутацию Исполнителя, а также информации, побуждающей и призывающей к межнациональной, этнической, половой, расовой нетерпимости, вражде, войне, изменению государственного устройства стран, информации, распространение которой запрещено действующим законодательством Украины и нормами Международного права в зависимости от территории предоставления услуг.
        `,
        `
          5.17. Передавать и/или предоставлять доступ к Курсам любым третьим лицам, а также получать Услуги совместно с третьими лицами.
        `,
        `
          6. ПРАВА И ОБЯЗАННОСТИ ИСПОЛНИТЕЛЯ
        `,
        `
          Исполнитель имеет право:
        `,
        `
          6.1. Самостоятельно определять формы и способы предоставления Услуг, учитывая требования действующего законодательства Украины и условия Договора.
        `,
        `
          6.2. В одностороннем порядке определить стоимость Услуг.
        `,
        `
          6.3. Самостоятельно определять/изменять содержание, продолжительность, количество информации в  рамках Курсов, функциональные возможности, интерфейс Веб-страницы в процессе предоставления Услуги.
        `,
        `
          6.4. Самостоятельно привлечь к оказанию Услуг третьих лиц, в том числе авторов курсов.
        `,
        `
          6.5. Получать от Заказчика любую информацию, необходимую для выполнения своих обязательств по Договору. В случае непредставления информации, неполного или неправильного представления информации, Исполнитель вправе приостановить предоставление Услуг по Договору до представления Заказчиком такой информации.
        `,
        `
          6.6. Проводить анкетирование, опрос Заказчика, в том числе запрашивать полученные отзывы о полученных Услугах, распространять (публиковать или иным образом распространять) результаты анкетирования (опроса) и полученные отзывы о полученных Услугах с соблюдением требований законодательства Украины о защите персональных данных.
        `,
        `
          6.7. Отказаться от предоставления Услуг или ограничить доступ Исполнителя к Программе без возврата уплаченных средств в следующих случаях:
        `,
        `
          6.7.1. Предоставление Заказчиком недостоверной информации.
        `,
        `
          6.7.2. Нарушение Заказчиком пп. 4.8, 4,9, 5.10-5.17 Договора.
        `,
        `
          6.8. Осуществлять массовую рассылку информационных сообщений (в том числе рекламных) на электронный адрес Заказчика. При этом такие сообщения должны содержать ссылки для отказа от рассылки, которая позволяет Заказчику самостоятельно отказаться от получения данной рассылки.
        `,
        `
          6.9. В одностороннем порядке вносить изменения в условия Договора путем размещения новой редакции Договора на Сайте.
        `,
        `
          6.10. Консультировать Заказчика во время оформления /подтверждения/ оплаты стоимости Курса, в том числе самостоятельно связываться с Заказчиком по адресу электронной почты или телефонному номеру, указанному Заказчиком при заполнении Заявки-анкеты.
        `,
        `
          6.11. В любое время менять условия этой Оферты в одностороннем порядке, без предварительного уведомления Заказчика, путем публикации изменений на Веб-сайте, не позднее 3х рабочих дней со дня ее принятия/ внесения.  Исполнитель рекомендует Заказчику регулярно проверять условия настоящей Оферты на предмет изменений и / или дополнений. Продолжение использования Веб-сайта Заказчиком после внесения Исполнителем изменений и / или дополнений к Оферте означает безусловное и полное принятие и согласие Заказчика с такими изменениями и дополнениями.
        `,
        `
          Исполнитель обязуется:
        `,
        `
          6.10. Предоставить Услуги надлежащего качества в порядке и на условиях, предусмотренных настоящим Договором.
        `,
        `
          6.11. Хранить информацию и сведения (в том числе персональные данные), полученные от Заказчика на выполнение условий настоящего Договора.
        `,
        `
          6.12. Предоставлять Заказчику информацию о предоставляемых Услугах, условия их предоставления.
        `,
        `
          7. ГАРАНТИИ И УДОСТОВЕРЕНИЯ СТОРОН
        `,
        `
          7.1. Заказчик, принимая условия настоящего Договора, принимает на себя риск неполучения прибыли и риск возможных убытков, связанных с использованием знаний, умений, навыков, полученных Заказчиком в ходе предоставления Услуг.
        `,
        `
          7.2. Исполнитель, гарантируя качество предоставляемых Услуг, не предоставляет гарантий на бесперебойность, безопасность, безошибочность и точное соответствие Услуг ожиданиям Заказчика к содержанию Услуг и полученных им результатов.
        `,
        `
          7.3. Гарантируя успешность применения полученных знаний, умений, навыков, а также получения Заказчиком Услуги определенной прибыли (дохода) с их использованием (реализацией) в определенном, или неопределенном будущем, Исполнитель не несет ответственности за неполучение прибыли (дохода), получение прибыли (дохода) ниже ожиданий Заказчика, а также за прямые и косвенные убытки Заказчика, поскольку успешность использования Заказчиком полученных знаний, умений и навыков, зависит от многих известных и неизвестных Исполнителю факторов: целеустремленности, трудолюбия, упорства, уровня интеллектуального развития, творческих способностей Заказчика, других его индивидуальных качеств и персональных характеристик, что принимается обеими Сторонами.
        `,
        `
          7.4. Исполнитель не осуществляет образовательную, преподавательскую или педагогическую деятельность и не предоставляет образовательные услуги, не выдает каких-либо сертификатов, свидетельств, дипломов и тому подобное.
        `,
        `
          7.5. Соглашаясь с условиями Договора и принимая его условия, Заказчик гарантирует, что указал полные, достоверные и актуальные данные, в том числе персональные данные, при заполнении Заявки-анкеты на приобретение Курса, введении любых регистрационных данных и осуществлении оплаты и не использует данные других лиц (в том числе персональные данные).
        `,
        `
          7.6. Заказчик гарантирует, что не намерен осуществлять любые действия, которые помешали бы деловой репутации Исполнителя и / или третьих лиц, связанных договорными отношениями с Исполнителем, или противоречащие законодательству Украины, международным нормам и обычаям делового оборота; его действия направлены на получение услуг и в них не содержится злого умысла, мошеннических намерений, попыток несанкционированного доступа к информации, которая является собственностью Исполнителя.
        `,
        `
          7.7. Стороны гарантируют, что имеют необходимый объем правоспособности и дееспособности для заключения Договора.
        `,
        `
          7.8. В случае, если доступ к выбранному Курсу был предоставлен Заказчику и Заказчик приступил к просмотру курса (хотя бы к 1 уроку), то услуга считается оказанной и выполненной со стороны Исполнителя в полном объеме. Возврат оплаты в таком случае не предусмотрен.  Если Заказчик, по каким-либо причинам решил отказаться от Курса после оплаты и до момента просмотра хотя бы одного урока Курса, то Исполнитель по заявлению Заказчика возвращает оплаченную сумму за выбранный Курс, за вычетом комиссии платежных систем и на карту, с которой была совершена оплата.
        `,
        `
          7.9. Заявление на возврат средств, указанное в п. 7.8 Договора, направляется Заказчиком на следующий адрес analytics.academy.2021@gmail.com
        `,
        `
          Ответственность за правильность данных, указанных в Заявлении несет Заказчик. Заявление на возврат средств должно содержать следующую информацию:
        `,
        `
          7.9.1. Фамилия, имя, отчество Заказчика;
        `,
        `
          7.9.2. Способ, дату и сумму оплаты Услуг;
        `,
        `
          7.9.3. Причины, по которым Заказчик отказался от Курса;
        `,
        `
          7.9.4. Банковские реквизиты для возврата средств.
        `,
        `
          7.10. При условии соответствия Заявления на возврат средств требованиям п.п. 7.8, 7.9 Договора, Исполнитель возвращает оплаченные средства в течение 5 (пяти) календарных дней со дня получения заявления. Возврат средств производится за вычетом комиссии платежных систем и на карту, с которой была совершена оплата.
        `,
        `
          7.11. В случае отсутствия в заявлении на возврат средств информации, указанной в п. 7.9 Договора или предоставление недостоверной информации, Исполнитель вправе отказать Заказчику в возврате средств.
        `,
        `
          7.12. В случае нарушения Заказчиком пп. 4.8, 4.9,   5.10.-5.17 Договора, средства, уплаченные Заказчиком Исполнителю, не возвращаются.
        `,
        `
          7.13. Любые претензии, заявления направлены Заказчиком после окончания срока указанного в п. 7.8 Договора, Исполнителем не рассматриваются.
        `,
        `
          8. ОТВЕТСТВЕННОСТЬ СТОРОН
        `,
        `
          8.1. В случае неисполнения или ненадлежащего исполнения обязательств, установленных Договором, Стороны несут ответственность в соответствии с законодательством Украины и положениями Договора.
        `,
        `
          8.2. Исполнитель не несет ответственности за неполучение Заказчиком услуг по настоящему Договору, в случае:
        `,
        `
          8.2.1. Предоставления Заказчиком недостоверной информации во исполнение условий Договора, в том числе, но неисключительно, контактной информации (e-mail, Skype, Viber), а также непредоставление информации в случае изменения информации, предоставленной ранее;
        `,
        `
          8.2.2. Заказчик не может получить Услуги по техническим причинам, не зависящим от Исполнителя, в частности, при отсутствии у Заказчика доступа к сети Интернет в результате действий операторов связи, провайдеров, влияния компьютерных вирусов и / или других вредоносных программ, в связи с отсутствием у него необходимых программно-аппаратных средств и/или ненадлежащей оплаты такого доступа.
        `,
        `
          8.3. Исполнитель не несет ответственности за качество каналов связи общего пользования или служб, предоставляющих доступ Заказчику к Услугам, предоставляемых Исполнителем.
        `,
        `
          8.4. Исполнитель не несет ответственности за действия Заказчика, в результате которых был нанесен ущерб другим Заказчикам услуг Исполнителя, как и не несет ответственности за ущерб, причиненный Заказчику вследствие действий других Заказчиков услуг.
        `,
        `
          8.5. Исполнитель не несет ответственности за несоответствие содержания Услуги ожиданиям Заказчика и /или его субъективную оценку. Такое несоответствие ожиданиям и/или отрицательная субъективная оценка не является основанием считать услуги предоставленными некачественно, или не в согласованном объеме.
        `,
        `
          8.6. Исполнитель не несет ответственности за действия третьих лиц, имевшие место при авторизации их на Сайте (Веб-странице) от имени Заказчика.
        `,
        `
          8.7. Заказчик самостоятельно несет ответственность за любые последствия, в том числе за ожидаемые результаты от полученной Услуги.
        `,
        `
          8.8. Все споры между Сторонами рассматриваются путем переговоров на основе урегулирования конфликта с максимальным учетом интересов Заказчика и Исполнителя.
        `,
        `
          8.9. В случае, если Стороны не смогут прийти к согласию по спорным вопросам путем переговоров, такие споры подлежат передаче на рассмотрение суда в соответствии с действующим законодательством Украины.
        `,
        `
           9. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ (ФОРС-МАЖОР)
        `,
        `
          9.1. Стороны освобождаются от ответственности за частичное или полное неисполнение любого из положений Договора, если это является следствием обстоятельств, которые наступили после вступления Договора в силу и находятся вне сферы контроля невыполняющей стороны. Такие причины включают стихийное бедствие, экстремальные погодные условия, пожары, войны, забастовки, военные действия, гражданские беспорядки, террористические акты, сбои в работе телефонных сетей общего пользования, электронных каналов связи, а также решения государственных органов и т.д., но не ограничиваются ими (далее — форс-мажор). Период освобождения от ответственности начинается с момента объявления невыполняющей Стороной форс-мажора, что подтверждается соответствующей справкой, заверенной торгово-промышленной палатой или другими доказательствами. Если форс-мажор возник в результате решения государственных органов, Стороны считают, что текст такого решения является достаточным доказательством наступления обстоятельств форс-мажора.
        `,
        `
          9.2. Обстоятельства форс-мажора автоматически продлевают срок исполнения обязательств на весь период его действия и ликвидации последствий. О наступлении форс-мажорных обстоятельств Стороны должны информировать друг друга безотлагательно. Если эти обстоятельства будут продолжаться более шести месяцев, то каждая из Сторон будет иметь право отказаться от дальнейшего исполнения обязательств по Договору, и в таком случае ни одна из Сторон не будет иметь право на возмещение другой Стороной возможных убытков.
        `,
        `
           10. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ И КОНФИДЕНЦИАЛЬНАЯ ИНФОРМАЦИЯ
        `,
        `
          10.1. Соглашаясь с условиями Договора и принимая условия Договора, Заказчик предоставляет Исполнителю однозначное согласие на обработку и использование любых персональных данных, ставших известными Исполнителю в результате предоставления Услуг на условиях настоящего Договора в соответствии с законодательством Украины в сфере защиты персональных данных.
        `,
        `
          10.2. Собственным акцептированием Договора Заказчик подтверждает, что он уведомлен о включении его персональных данных в базу персональных данных, владельцем которой является Исполнитель, с целью обработки персональных данных, указанной в настоящем пункте, а также о своих правах, указанных в статье 8 Закона Украины «О защите персональных данных». Заказчик добровольно дает согласие на сбор и обработку собственных персональных данных с последующей целью: данные, которые становятся известны, будут использоваться в коммерческих целях, в том числе для обработки заказов на приобретение услуг, получения информации о Заказе, отправка телекоммуникационными средствами связи (по электронной почте, мобильной связью) рекламных и специальных предложений, информации об акциях, розыгрышах или любой другой информации о деятельности Исполнителя.
        `,
        `
          Для целей, предусмотренных настоящим пунктом, Заказчику вправе направлять письма, сообщения и материалы на почтовый адрес, e-mail Заказчика, а также отправлять sms-сообщения, осуществлять звонки на указанный в Заказе- анкете или на телефонный номер.
        `,
        `
          10.3. Исполнитель дает право осуществлять обработку его персональных данных, в том числе: помещать персональные данные в базы данных (без дополнительного уведомления об этом), осуществлять пожизненное хранение данных, их накопления, обновление, изменение (по мере необходимости). Исполнитель обязуется обеспечить защиту данных от несанкционированного доступа третьих лиц, не распространять и не передавать данные любой третьей стороне (кроме передачи данных связанным лицам, коммерческим партнерам, лицам, уполномоченным Исполнителем на осуществление непосредственной обработки данных для указанных целей, а также на обязательный запрос компетентного государственного органа).
        `,
        `
          10.4. Обработка персональных данных включает, но не ограничивается, сбор, регистрацию, накопление, хранение, адаптацию, изменение, обновление, использование и распространение (распространение, реализацию, передачу), обезличивание, уничтожение персональных данных, обрабатываемых Исполнителем, любым лицом, связанным с Исполнителем отношениями контроля с целью ведения базы персональных данных Заказчиков.
        `,
        `
          10.5. Заказчик соглашается, что Исполнитель не должен получать дополнительного согласия Заказчика для передачи персональных данных Заказчика любому лицу, связанному с Исполнителем отношениями контроля или в рамках договорных отношений.
        `,
        `
          10.6. Информация о Заказчике используется в целях выполнения его Заказа, отправки предложений и информационных материалов Исполнителя и/или размещения отзывов Заказчика о предоставленных услугах Исполнителем, в случае их наявности. В случае нежелания получать рассылку, Заказчик вправе обратиться к Исполнителю, написав заявление об отказе от получение рекламных и/или информационных материалов, направив его на почтовый или электронный адрес.
        `,
        `
          10.7. Исполнитель не несет ответственности за содержание и достоверность информации, предоставляемой Заказчиком при оформлении заказа.
        `,
        `
          10.8. Вся информация, которая стала известна Заказчику в связи с получением Услуг от Исполнителя по настоящему Договору, является конфиденциальной информацией и коммерческой тайной Исполнителя.
        `,
        `
          10.9. Заказчик обязуется не разглашать и не передавать конфиденциальную информацию и коммерческую тайну Исполнителя для ознакомления и/или использования третьим лицам без предварительного письменного согласия Исполнителя.
        `,
        `
           11. ПРАВА ИНТЕЛЛЕКТУАЛЬНОЙ СОБСТВЕННОСТИ
        `,
        `
          11.1. Все занятия в форме выступлений, лекций, выступлений; аудио и видео-практики, аудио- и видео-уроки, записи онлайн трансляций в виде аудиовизуальных произведений, фонограмм и видеограм, фотографические произведения, изображения, статьи и любые другие материалы, полученные Заказчиком на выполнение условий этого Договора (далее — Материалы) являются объектами прав интеллектуальной собственности Исполнителя и подлежат защите.
        `,
        `
          11.2. Авторские и смежные права на Материалы, к которым предоставляется доступ Заказчику принадлежат Исполнителю. Заказчику предоставляется лишь право пользования Материалами исключительно для личных некоммерческих целей.
        `,
        `
          11.3. Запрещается любым способом копирование, воспроизведение, распространение, исполнение, публичное сообщение, демонстрация, показ, использование, перевод, переработка, адаптация и любые подобные изменения Материалов без предварительного письменного согласия Исполнителя.
        `,
        `
            12. ПРОЧИЕ УСЛОВИЯ
        `,
        `
          12.1. Настоящий Договор вступает в силу с момента его заключения, предусмотренного п. 2.5 Договора и действует до полного исполнения Сторонами условий Договора.
        `,
        `
          12.2. Настоящий Договор может быть расторгнут до истечения срока его действия по взаимному согласию Сторон или в одностороннем порядке в случаях, предусмотренных настоящим Договором с соблюдением условий настоящего Договора.
        `,
        `
          12.3. За исключением гарантий, прямо указанных в тексте Оферты, Исполнитель не предоставляет никаких других прямых или подразумеваемых гарантий по Договору и прямо отказывается от любых гарантий и/или условий относительно нарушения прав, соответствия услуг конкретным целям Заказчика.
        `,
        `
          12.4. Соглашаясь с условиями и принимая условия настоящей Оферты путем акцепта оферты, Заказчик (или представитель Заказчика, в т. ч. Физическое лицо, должным образом уполномоченное заключить Договор от имени Заказчика) уверяет Исполнителя и гарантирует Исполнителю, что:
        `,
        `
          12.4.1. Заказчик (представитель Заказчика) предоставил достоверные данные, в том числе персональные данные Заказчика (представителя Заказчика) для оформления платежных документов по оплате услуг.
        `,
        `
          12.4.2. Заказчик заключает договор добровольно, при этом заказчик (представитель Заказчика): а) полностью ознакомился с условиями Оферты, б) полностью понимает предмет Оферты и Договора, в) полностью понимает значение и последствия своих действий по заключению и исполнению договора.
        `,
        `
           12.4.3. Заказчик (представитель Заказчика) имеет все права и полномочия, необходимые для заключения и исполнения Договора.
        `,
        `
          12.5. В случаях, не предусмотренных настоящим Договором, Стороны руководствуются действующим законодательством Украины.
        `,
        `
          12.6. Стороны подтверждают полное и однозначное понимание ими предмета и содержания настоящего Договора, прав и обязанностей каждой Стороны, вытекающих или связанных с выполнением Договора, суть терминов, употребляемых в Договоре, а также соответствие текста Договора намерениям и воле Сторон.
        `,
        `
          12.7. Если любое положение (часть) Договора является или становится недействительным по любым основаниям, этот факт не влияет на действительность других положений Договора в целом.
        `,
        `
          12.8. Стороны соглашаются, что к отношениям, возникшим между ними на основании настоящего Договора, применяется право Украины.
        `,
        `
          12.9. Стороны вправе в любой момент заключить этот договор в форме письменного двухстороннего документа.
        `,
        `
          13. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ
        `,
        `
          ФОП Фокина Илона Владимировна,
        `,
        `
          ЄДРПОУ 2750313661,
        `,
        `
          UA593052990000026001045005459,
        `,
        `
          АТ КБ "ПРИВАТБАНК"
        `,
        `
          Место регистрации: 08135 Украина, Киевская область, Киево-Святошинский р-н, улица Валерия Лобановського, дом 26/1, квартира 89
        `,
        `
          e-mail: analytics.academy.2021@gmail.com
        `,
        `
          тел.: +38(050) 484 1268
        `,
      ] : [
        `
          ДОГОВІР ОФЕРТИ
        `,
        `
          Публічний договір (оферта)
        `,
        `
          Справжня оферта адресована будь-якій особі (невизначеному колу осіб) (далі «Замовник») і є публічною пропозицією Виконавця укласти договір про надання послуг, розміщений в мережі Інтернет за адресою analytics-academy.com.ua і може відправлятися на електронну пошту Замовника (далі Договір) на наступних умовах:
        `,
        `
          1. ВИЗНАЧЕННЯ ТЕРМІНІВ
        `,
        `
          Для цілей цього Договору терміни вживаються в такому значенні:
        `,
        `
          1.1. Акцепт - повне, безумовне і беззастережне прийняття Замовником умов цього Договору без будь-яких винятків і / або обмежень і є рівносильним висновку двостороннього письмового Договору.
        `,
        `
          1.2. Замовник - особа, яка вчинила Акцепт умов цього Договору і стає Замовником послуг Виконавця за укладеним Договором. Замовником може бути будь-яка дієздатна фізична особа, яка досягла 18 років, яка має намір отримати послуги Виконавця в порядку і на умовах, визначених цим Договором.
        `,
        `
          1.3. Виконавець - ФОП Фокіна Ілона Володимирівна. Найменування Виконавця вказується в рахунку або інших документах на оплату Послуг.
        `,
        `
          1.4. Послуга - діяльність Виконавця, пов'язана   наданням послуг з навчання населення на курсах, шляхом надання доступу Замовників до окремих розділів (курсам) Сайту Виконавця та  надання посилання на завантаження роздавальних матеріалів обраного курсу. Опис Курсів, їх вартість доступні на Сайті Виконавця analytics-academy.com.ua.
        `,
        `
          1.5. Курс - цілісна сформована сукупність оффлайн занять, електронних версій аудіо-, відеозаписів занять, курсів, текстових, аудіовізуальних творів, пов'язаних між собою і структурованих на певну тему, захищених законодавством України у сфері інтелектуальної власності, доступ до яких надається через Сайт або Веб-сторінку для використання Замовником.
        `,
        `
          1.6. Сайт - сукупність даних, електронної (цифрової) інформації, інших об'єктів авторського права і (або) суміжних прав і т.п., пов'язаних між собою і структурованих в межах адреси analytics-academy.com.ua, доступ до яких здійснюється через вказану адресу мережі Інтернет.
        `,
        `
          1.7. Персональне посилання - персональний формалізований у відповідності зі стандартами мережі Інтернет запис адреси сайту або його частини (Веб-сторінки), що дозволяє Замовнику отримати доступ до Сайту в мережі Інтернет.
        `,
        `
          2. ОСНОВНІ ПОЛОЖЕННЯ
        `,
        `
          2.1. Договір укладається між Виконавцем і Замовником послуг в формі договору приєднання. Договір публічної оферти є публічним, тобто відповідно до статей 633, 641 Цивільного кодексу України його умови однакові для всіх Замовників незалежно від статусу (фізична особа, юридична особа, фізична особа — підприємець) та резиденства. При повній згоді з даним Договором, Замовник приймає умови, порядок оплати і надання послуг Виконавцем, відповідальності за невиконання умов цього Договору.
        `,
        `
          2.2. Цей Договір є публічним договором (далі - Договір), який вважається укладеним між Виконавцем, з одного боку, Замовником, з іншого, з моменту Акцепту останнім всіх без винятку умов і положень цього Договору.
        `,
        `
          2.3. В порядку та на умовах, визначених цим Договором, Виконавець зобов'язується надати Замовнику послуги, а Замовник зобов'язується прийняти та оплатити надані Послуги.
        `,
        `
          2.4. Діями, що свідчать про згоду дотримуватися умов цього Договору, є Акцепт Замовником умов цього Договору.
        `,
        `
           2.5. Замовник здійснює акцепт Договору після ознайомлення з його умовами, розміщеними на Сайті шляхом сукупного або окремого виконання будь-якого з наступних дій:
        `,
        `
          2.5.1. Заповнення Замовником заявки-анкети з вибору  курсу;
        `,
        `
          2.5.2. Оплати Замовником послуги в повному обсязі;
        `,
        `
          2.5.3. Проставляння відповідної відмітки «Я згоден (-на) з політикою конфіденційності і приймаю публічний договір оферти».
        `,
        `
          2.6. Перелік і вартість надання Послуг розміщені на Сайті.
        `,
        `
          3. ВАРТІСТЬ ПОСЛУГ І ПОРЯДОК РОЗРАХУНКІВ
        `,
        `
          3.1. Вартість Послуг залежить від обраних Курсів і вказується на Сайті Виконавця. За бажанням Замовника, йому може бути виставлений рахунок на оплату послуг.
        `,
        `
          3.2. Виконавець має право в односторонньому порядку змінити вартість Послуг до моменту оплати шляхом публікації нової ціни на Сайті.
        `,
        `
          3.3. Замовник здійснює оплату послуг на умовах 100% передоплати.
        `,
        `
          3.4. Оплата Послуг Виконавцем означає ознайомлення і повну згоду Замовника з умовами цього Договору.
        `,
        `
          3.5. Оплата Послуг здійснюється шляхом перерахування грошових коштів на поточний рахунок Виконавця.
        `,
        `
          3.6. Послуга вважається оплаченою з моменту зарахування коштів на поточний рахунок Виконавця.
        `,
        `
          4. УМОВИ НАДАННЯ ПОСЛУГ
        `,
        `
          4.1. Для отримання послуг Виконавця Замовник обирає на сайті курс, що його зацікавив, натиснувши кнопку «Купити», Замовник перенаправляється в платіжну систему Liq Pay, де оплачується послуга за реквізитами Виконавця.
        `,
        `
          4.4. Після отримання оплати Виконавцем Замовнику автоматично відкривається доступ до уроків та надається посилання на завантаження роздаткових матеріалів вибраного курсу. При отриманні доступу до всіх уроків курсу послуга вважається наданою.
        `,
        `
          4.5. У разі неотримання Замовником доступу, Замовник повинен звернутися до служби підтримки Виконавця шляхом надсилання листа на електронну пошту:  analytics.academy.2021@gmail.com
        `,
        `
          4.6. Персональний доступ є дійсним для одного Замовника. Забороняється передача доступу третім особам.
        `,
        `
          4.7. Для отримання Послуги Замовник самостійно забезпечує дотримання належних технічних умов персонального комп'ютера або іншого мобільного пристрою.
        `,
        `
          4.8. Використання Замовником отриманих інформації та матеріалів (аудіо-, відеозаписів тощо) допускається лише в особистих цілях та для особистого використання.
        `,
        `
          4.9. Виконавець має право відмовитися від надання послуг в односторонньому порядку та анулювати доступ Замовника до обраної програми у разі встановлення фактів передачі Замовником доступу третім особам, розповсюдження інформації та матеріалів (аудіо, відео тощо), отриманих внаслідок отримання Послуг, третім особам.
        `,
        `
           5. ПРАВА ТА ОБОВ'ЯЗКИ ЗАМОВНИКА
        `,
        `
          Замовник має право:
        `,
        `
          5.1. Отримати Послуги на умовах цього Договору.
        `,
        `
          5.2. Отримати від Виконавця інформацію про надані Послуги, умови їх надання за телефонами, вказаними на Сайті, або надіславши відповідний запит на електронну пошту, вказану на Сайті.
        `,
        `
          5.3. Входити на канал  під своїм обліковим записом одночасно тільки з однієї точки доступу (персональний комп'ютер, ноутбук, нетбук, планшет і ін.).
        `,
        `
          5.4. Замовник користується всіма правами споживача відповідно до чинного законодавства України, що регулює дані правовідносини.
        `,
        `
          Замовник зобов'язується:
        `,
        `
          5.5. Оплатити Послуги в повному обсязі в порядку і строки, передбачені цим Договором.
        `,
        `
          5.6. Надати достовірну інформацію про себе в процесі заповнення заявки на участь придбання курсу. Замовник несе відповідальність за достовірність такої інформації.
        `,
        `
          5.7. Підтримувати в справному технічному стані обладнання та канали зв'язку, що забезпечують доступ до Сайту.
        `,
        `
          5.8. Виконувати рекомендації, домашні завдання, вимоги і т.п. Виконавця, викладені у відповідному Курсі.
        `,
        `
          5.9. Надати Виконавцю актуальну інформацію про засоби зв'язку для направлення інформаційних матеріалів, а також для зв'язку Виконавця з Замовником в рамках надання Послуг, згідно з цим Договором.
        `,
        `
          Замовнику забороняється:
        `,
        `
          5.10. Здійснювати в будь-якій формі запис (шляхом аудіо-, відеозапису, скачування, скріншоти, фотографування та інших способів зберігання інформації) Курсу, проведеного в рамках надання Послуг за цим Договором.
        `,
        `
          5.11. Копіювати, поширювати будь-яким способом аудіо-, відео-, інформаційні матеріали Курсу, отримані в рамках цього Договору.
        `,
        `
          5.12. Поширювати матеріали, отримані в рамках зазначеного Договору шляхом розшифровки (переведення аудіо- і відеоматеріалів в текстовий формат) або переведення на інші мови.
        `,
        `
          5.13. Використовувати отриману в рамках цього Договору інформацію, матеріали в комерційних цілях шляхом переказування або поширення в будь-який спосіб отриманих від Виконавця знань.
        `,
        `
          5.14. Використовувати отриману від Виконавця інформацію, включаючи (без обмеження) з метою створення подібної і / або конкурентної послуги або сервісу, або з метою отримання комерційної або фінансової вигоди без попереднього узгодження з Виконавцем.
        `,
        `
          5.15. Здійснювати свою діяльність на основі Послуг Виконавця.
        `,
        `
          5.16. Допускати поширення недостовірної, неправдивої інформації, інформації, що ганьбить честь, гідність, ділову репутацію Виконавця,  а також інформації, що спонукає і закликає до міжнаціональної, етнічної, статевої, расової нетерпимості, ворожнечі, війни, зміни державного устрою країн, інформації, поширення якої заборонено чинним законодавством України та нормами Міжнародного права в залежності від території надання послуг.
        `,
        `
          5.17. Передавати і / або надавати доступ к Курсам будь-яким третім особам, а також отримувати Послуги спільно з третіми особами.
        `,
        `
          6. ПРАВА ТА ОБОВ'ЯЗКИ ВИКОНАВЦЯ
        `,
        `
          Виконавець має право:
        `,
        `
          6.1. Самостійно визначати форми і способи надання Послуг, враховуючи вимоги чинного законодавства України та умови Договору.
        `,
        `
          6.2. В односторонньому порядку визначити вартість Послуг.
        `,
        `
          6.3. Самостійно визначати / змінювати зміст, тривалість, кількість інформації в рамках Курсів, функціональні можливості, інтерфейс Веб-сторінки в процесі надання Послуги.
        `,
        `
          6.4. Самостійно залучити до надання Послуг третіх осіб, в тому числі авторів курсів.
        `,
        `
          6.5. Отримувати від Замовника будь-яку інформацію, необхідну для виконання своїх зобов'язань за Договором. У разі неподання інформації, неповного або неправильного уявлення інформації, Виконавець має право призупинити надання Послуг за Договором до подання Замовником такої інформації.
        `,
        `
          6.6. Проводити анкетування, опитування Замовника, в тому числі запитувати відгуки про отримані Послуги, поширювати (публікувати або іншим чином поширювати) результати анкетування (опитування) і отримані відгуки про отримані Послуги з дотриманням вимог законодавства України про захист персональних даних.
        `,
        `
          6.7. Відмовитися від надання Послуг або обмежити доступ Виконавця до Курсу без повернення сплачених коштів в наступних випадках:
        `,
        `
          6.7.1. Надання Замовником недостовірної інформації.
        `,
        `
          6.7.2. Порушення Замовником пп. 4.8, 4,9, 5.10-5.17 Договору.
        `,
        `
          6.8. Здійснювати масову розсилку інформаційних повідомлень (у тому числі рекламних) на електронну адресу Замовника. При цьому такі повідомлення повинні містити посилання для відмови від розсилки, яка дозволяє Замовнику самостійно відмовитися від отримання даної розсилки.
        `,
        `
          6.9. В односторонньому порядку вносити зміни в умови Договору шляхом розміщення нової редакції Договору на Сайті.
        `,
        `
          6.10. Консультувати Замовника під час оформлення /підтвердження/ оплати вартості Курсу, у тому числі самостійно зв'язуватися із Замовником за адресою електронної пошти або телефонним номером, вказаним Замовником при заповненні Заявки-анкети.
        `,
        `
          6.11. У будь-який час міняти умови цієї Оферти в односторонньому порядку, без попереднього повідомлення Замовника, шляхом публікації змін на Веб-сайті, не пізніше  3-х робочих днів з дня її прийняття/ внесення. Виконавець рекомендує Замовникові регулярно перевіряти умови справжньої Оферти на предмет змін і / або доповнень. Продовження використання Веб-сайту Замовником після внесення Виконавцем змін і / або доповнень до Оферти означає безумовне і повне прийняття і згоду Замовника з такими змінами і доповненнями.
        `,
        `
          Виконавець зобов'язується:
        `,
        `
          6.12. Надати Послуги належної якості в порядку і на умовах, передбачених цим Договором.
        `,
        `
          6.13. Зберігати інформацію і відомості (в тому числі персональні дані), отримані від Замовника на виконання умов цього Договору.
        `,
        `
          6.14. Надавати Замовнику інформацію про надані Послуги, умови їх надання.
        `,
        `
          7. ГАРАНТІЇ І ПОСВІДЧЕННЯ СТОРІН
        `,
        `
          7.1. Замовник, приймаючи умови даного Договору, приймає на себе ризик неотримання прибутку і ризик можливих збитків, пов'язаних з використанням знань, умінь, навичок, отриманих Замовником під час надання Послуг.
        `,
        `
          7.2. Виконавець, гарантуючи якість наданих Послуг, не надає гарантій на безперебійність, безпеку, безпомилковість і точну відповідність Послуг очікуванням Замовника до змісту Послуг і отриманих ним результатів.
        `,
        `
          7.3. Гарантуючи успішність застосування отриманих знань, умінь, навичок, а також отримання Замовником Послуги певного прибутку (доходу) з їх використанням (реалізацією) у певному, або невизначеному майбутньому, Виконавець не несе відповідальності за неотримання прибутку (доходу), отримання прибутку (доходу) нижче очікувань Замовника, а також за прямі і непрямі збитки Замовника, оскільки успішність використання Замовником отриманих знань, умінь і навичок, залежить від багатьох відомих і невідомих Виконавцю факторів: цілеспрямованості, працьовитості, завзятості, рівня інтелектуального розвитку, творчих здібностей Замовника, інших його індивідуальних якостей і персональних характеристик, що приймається обома Сторонами.
        `,
        `
          7.4. Виконавець не здійснює освітню, викладацьку або педагогічну діяльність і не надає освітні послуги, не видає будь-яких сертифікатів, свідоцтв, дипломів тощо.
        `,
        `
          7.5. Погоджуючись з умовами Договору та приймаючи його умови, Замовник гарантує, що вказав повні, достовірні і актуальні дані, в тому числі персональні дані, при заповненні Заявки-анкети на отримання Курсу, введення будь-яких реєстраційних даних і здійсненні оплати і не використовує дані інших осіб (в тому числі персональні дані).
        `,
        `
          7.6. Замовник гарантує, що не має наміру здійснювати будь-які дії, які завадили б ділової репутації Виконавця та / або третіх осіб, пов'язаних договірними відносинами з Виконавцем, або такі, що суперечать законодавству України, міжнародним нормам і звичаям ділового обороту; його дії спрямовані на отримання послуг та в них не міститься злого умислу, шахрайських намірів, спроб несанкціонованого доступу до інформації, яка є власністю Виконавця.
        `,
        `
          7.7. Сторони гарантують, що мають необхідний обсяг правоздатності та дієздатності для укладення Договору.
        `,
        `
          7.8. У разі, якщо доступ до вибраного Курсу був наданий Замовникові і Замовник приступив до перегляду курсу (хоч би до 1 уроку), то послуга вважається зробленою і виконаною з боку Виконавця в повному об'ємі. Повернення оплати у такому разі не передбачене. Якщо Замовник, по яких або причинам вирішив відмовитися від Курсу після оплати і до моменту перегляду хоч би одного уроку Курсу, то Виконавець за заявою Замовника повертає сплачену суму за вибраний Курс, за вирахуванням комісії платіжних систем і на карту, з якою була здійснена оплата.
        `,
        `
          7.9. Заява на повернення коштів, зазначена в п. 7.8 Договору, направляється Замовником на наступну адресу  analytics.academy.2021@gmail.com
        `,
        `
          Відповідальність за правильність даних, зазначених в Заяві несе Замовник. Заява на повернення коштів повинна містити наступну інформацію:
        `,
        `
          7.9.1. Прізвище, ім'я, по батькові Замовника;
        `,
        `
          7.9.2. Спосіб, дату і суму оплати Послуг;
        `,
        `
          7.9.3. Причини, через які Замовник відмовився від Курсу;
        `,
        `
          7.9.4. Банківські реквізити для повернення коштів.
        `,
        `
          7.10. За умови відповідності Заяви на повернення коштів вимогам п.п. 7.8, 7.9 Договору, Виконавець повертає сплачені кошти протягом 5 (п’яти) календарних днів з дня отримання заяви. Повернення коштів здійснюється за вирахуванням комісії платіжних систем і на карту, з якої була здійснена оплата.
        `,
        `
          7.11. У разі відсутності в заяві на повернення коштів інформації, зазначеної в п. 7.9 Договору або надання недостовірної інформації, Виконавець має право відмовити Замовнику в поверненні коштів.
        `,
        `
          7.12. У разі порушення Замовником пп. 4.8, 4.9, 5.10.-5.17 Договору, кошти, сплачені Замовником Виконавцю, не повертаються.
        `,
        `
          7.13. Будь-які претензії, заяви направлені Замовником після закінчення терміну зазначеного в п. 7.8 Договору, Виконавцем не розглядаються.
        `,
        `
        `,
        `
        `,
        `
          8. ВІДПОВІДАЛЬНІСТЬ СТОРІН
        `,
        `
          8.1. У разі невиконання або неналежного виконання зобов'язань, встановлених Договором, Сторони несуть відповідальність відповідно до законодавства України і положень Договору.
        `,
        `
          8.2. Виконавець не несе відповідальності за неотримання Замовником послуг за цим Договором, у разі:
        `,
        `
          8.2.1. Надання Замовником недостовірної інформації на виконання умов Договору, в тому числі, але невиключно, контактної інформації (e-mail, Skype, Viber), а також ненадання інформації в разі зміни інформації, наданої раніше;
        `,
        `
          8.2.2. Замовник не може отримати Послуги з технічних причин, не залежних від Виконавця, зокрема, при відсутності у Замовника доступу до мережі Інтернет в результаті дій операторів зв'язку, провайдерів, впливу комп'ютерних вірусів і / або інших шкідливих програм, в зв'язку з відсутністю у нього необхідних програмно-апаратних засобів та / або неналежної оплати такого доступу.
        `,
        `
          8.3. Виконавець не несе відповідальності за якість каналів зв'язку загального користування або служб, що надають доступ Замовнику до Послуг, що надаються Виконавцем.
        `,
        `
          8.4. Виконавець не несе відповідальності за дії Замовника, в результаті яких було завдано шкоди іншим Замовникам послуг Виконавця, як і не несе відповідальності за шкоду, заподіяну Замовнику внаслідок дій інших Замовників послуг.
        `,
        `
          8.5. Виконавець не несе відповідальності за невідповідність змісту Послуги очікуванням Замовника та / або його суб'єктивну оцінку. Така невідповідність очікуванням і / або негативна суб'єктивна оцінка не є підставою вважати послуги наданими неякісно, або не в узгодженому обсязі.
        `,
        `
          8.6. Виконавець не несе відповідальності за дії третіх осіб, що мали місце при авторизації їх на Сайті (Веб-сторінці) від імені Замовника.
        `,
        `
          8.7. Замовник самостійно несе відповідальність за будь-які наслідки, в тому числі за очікувані результати від отриманої Послуги.
        `,
        `
          8.8. Всі суперечки між Сторонами розглядаються шляхом переговорів на підставі врегулювання конфлікту з максимальним урахуванням інтересів Замовника і Виконавця.
        `,
        `
          8.9. У разі, якщо Сторони не зможуть дійти згоди зі спірних питань шляхом переговорів, такі спори передаються на розгляд суду відповідно до чинного законодавства України.
        `,
        `
          9. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ (ФОРС-МАЖОР)
        `,
        `
          9.1. Сторони звільняються від відповідальності за часткове або повне невиконання будь-якого з положень Договору, якщо це є наслідком обставин, які настали після набуття чинності Договором і знаходяться поза сферою контролю не виконуючої боку. Такі причини включають стихійне лихо, екстремальні погодні умови, пожежі, війни, страйки, військові дії, громадські заворушення, терористичні акти, збої в роботі телефонних мереж загального користування, електронних каналів зв'язку, а також рішення державних органів і т.п., але не обмежуються ними (далі - форс-мажор). Період звільнення від відповідальності починається з моменту оголошення не виконуючої Стороною форс-мажору, що підтверджується відповідною довідкою, завіреної торгово-промисловою палатою або іншими доказами. Якщо форс-мажор виник в результаті рішення державних органів, Сторони вважають, що текст такого рішення є достатнім доказом настання обставин форс-мажору.
        `,
        `
          9.2. Обставини форс-мажору автоматично продовжують термін виконання зобов'язань на весь період його дії та ліквідації наслідків. Про настання форс-мажорних обставин Сторони повинні інформувати один одного невідкладно. Якщо ці обставини триватимуть більше шести місяців, то кожна зі Сторін буде мати право відмовитися від подальшого виконання зобов'язань за Договором, і в такому випадку жодна із Сторін не матиме право на відшкодування іншою Стороною можливих збитків.
        `,
        `
          10. ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ І КОНФІДЕНЦІЙНА ІНФОРМАЦІЯ
        `,
        `
          10.1. Погоджуючись з умовами Договору та приймаючи умови Договору, Замовник надає Виконавцю однозначну згоду на обробку та використання будь-яких персональних даних, які стали відомими Виконавцю в результаті надання Послуг на умовах цього Договору відповідно до законодавства України в сфері захисту персональних даних.
        `,
        `
          10.2. Власним акцептуванням Договору Замовник, підтверджує, що він повідомлений про включення його персональних даних до бази персональних даних, володільцем якої є Виконавець, з метою обробки персональних даних, зазначеної у цьому пункті, а також про свої права, зазначені у статті 8 Закону України «Про захист персональних даних». Замовник добровільно надає згоду на збір та обробку власних персональних даних з наступною метою: дані, що стають відомі використовуватимуться в комерційних цілях, в тому числі для обробки замовлень на придбання Послуг, отримання інформації про Замовлення, надсилання телекомунікаційними засобами зв’язку (електронною поштою, мобільним зв’язком) рекламних та спеціальних пропозицій, інформації про акції, розіграші або будь-якої іншої інформації про діяльність Виконавця.
        `,
        `
          Для цілей, передбачених цим пунктом, Замовнику мають право направлятися листи, повідомлення та матеріали на поштову адресу, e-mail Замовника, а також відправлятися sms-повідомлення, здійснюватися дзвінки на вказаний в Замовлені та/або анкеті телефонний номер.
        `,
        `
          10.3. Виконавець дає право здійснювати обробку його персональних даних, у тому числі: поміщати персональні дані в бази даних (без додаткового повідомлення про це), здійснювати довічне зберігання даних, їх накопичення, оновлення, зміну (у разі необхідності). Виконавець бере на себе зобов'язання забезпечити захист даних від несанкціонованого доступу третіх осіб, не поширювати і не передавати дані будь-якій третій стороні (крім передачі даних пов'язаним особам, комерційним партнерам, особам, уповноваженим Виконавцем на здійснення безпосередньої обробки даних для зазначених цілей, а також на обов'язковий запит компетентного державного органу).
        `,
        `
          10.4. Обробка персональних даних включає, але не обмежується, збір, реєстрацію, накопичення, зберігання, адаптування, зміну, оновлення, використання і поширення (розповсюдження, реалізацію, передачу), знеособлення, знищення персональних даних, які обробляються Виконавцем, будь-якою особою, пов'язаним з Виконавцем відносинами контролю з метою ведення бази персональних даних Замовників.
        `,
        `
          10.5. Замовник погоджується, що Виконавець не повинен отримувати додаткової згоди Замовника для передачі персональних даних Замовника будь-якій особі, пов'язаній з Виконавцем відносинами контролю або в рамках договірних відносин.
        `,
        `
          10.6. Інформація про Замовника використовується в цілях виконання його Замовлення, надсилання пропозицій та інформаційних матеріалів Виконавця та/або розміщення відгуків Замовника про надані послуги Виконавцем, у разі їх наявності. У випадку небажання отримувати розсилку, Замовник має право звернутися до Виконавця, написавши заяву про відмову від отримання рекламних та/або інформаційних матеріалів, надіславши його на поштову або електронну адресу.
        `,
        `
          10.7. Виконавець не несе відповідальність за зміст і правдивість інформації, що надається Замовником при оформленні замовлення.
        `,
        `
          10.8. Вся інформація, яка стала відома Замовнику в зв'язку з отриманням Послуг від Виконавця за цим Договором  є конфіденційною інформацією і комерційною таємницею Виконавця.
        `,
        `
          10.9. Замовник зобов'язується не розголошувати і не передавати конфіденційну інформацію та комерційну таємницю Виконавця для ознайомлення і / або використання третім особам без попередньої письмової згоди Виконавця.
        `,
        `
          11. ПРАВА ІНТЕЛЕКТУАЛЬНОЇ ВЛАСНОСТІ
        `,
        `
          11.1. Всі заняття в формі виступів, лекцій, виступів; аудіо і відео-практики, аудіо- та відео-уроки, записи онлайн трансляцій у вигляді аудіовізуальних творів, фонограм і відеограм, фотографічні твори, зображення, статті та будь-які інші матеріали, отримані Замовником на виконання умов цього Договору (далі - Матеріали) є об'єктами прав інтелектуальної власності Виконавця і підлягають захисту.
        `,
        `
          11.2. Авторські та суміжні права на Матеріали, до яких надається доступ Замовнику належать Виконавцю. Замовнику надається лише право користування Матеріалами виключно для особистих некомерційних цілей.
        `,
        `
          11.3. Забороняється будь-яким способом копіювання, відтворення, розповсюдження, виконання, публічне сповіщення, демонстрація, показ, використання, переклад, переробка, адаптація і будь-які подібні зміни Матеріалів без попередньої письмової згоди Виконавця.
        `,
        `
          12. ІНШІ УМОВИ
        `,
        `
          12.1. Цей Договір набуває чинності з моменту його укладення, передбаченого п. 2.5 Договору та діє до повного виконання Сторонами умов Договору.
        `,
        `
          12.2. Цей Договір може бути розірваний до закінчення терміну його дії за взаємною згодою Сторін або в односторонньому порядку у випадках, передбачених цим Договором з дотриманням умов цього Договору.
        `,
        `
          12.3. За винятком гарантій, прямо зазначених у тексті Оферти, Виконавець не надає жодних інших прямих або домислюваних гарантій за Договором і прямо відмовляється від будь-яких гарантій та/або умов відносно порушення прав, відповідності Послуг конкретним цілям Замовника.
        `,
        `
          12.4. Погоджуючись з умовами та приймаючи умови цієї Оферти шляхом Акцепту Оферти, Замовник (чи представник Замовника, в т. ч. фізична особа, належним чином уповноважена укласти Договір від імені Замовника) запевняє Виконавця і гарантує Виконавцю, що:
        `,
        `
          12.4.1. Замовник (представник Замовника) надав достовірні дані, у тому числі персональні дані Замовника (представника Замовника) для оформлення платіжних документів з оплати Послуг.
        `,
        `
          12.4.2. Замовник укладає Договір добровільно, при цьому Замовник (представник Замовника): а) повністю ознайомився з умовами Оферти, б) повністю розуміє предмет Оферти та Договору, в) повністю розуміє значення та наслідки своїх дій щодо укладання та виконання Договору.
        `,
        `
          12.4.3. Замовник (представник Замовника) має всі права та повноваження, необхідні для  укладення і виконання Договору.
        `,
        `
          12.5. У випадках, не передбачених цим Договором, Сторони керуються чинним законодавством України.
        `,
        `
          12.6. Сторони підтверджують повне і однозначне розуміння ними предмета та змісту цього Договору, прав і обов'язків кожної Сторони, що випливають або пов'язаних з виконанням Договору, суть термінів, що вживаються в Договорі, а також відповідність тексту Договору намірам і волі Сторін.
        `,
        `
          12.7. Якщо будь-яке положення (частина) Договору є або стає недійсним з будь-яких підстав, цей факт не впливає на дійсність інших положень Договору в цілому.
        `,
        `
          12.8. Сторони погоджуються, що до відносин, які виникли між ними на підставі цього Договору, застосовується право України.
        `,
        `
          12.9. Сторони мають право в будь-який момент укласти цей договір у формі письмового двостороннього документа.
        `,
        `
           13. РЕКВІЗИТИ ВИКОНАВЦЯ
        `,
        `
          ФОП Фокіна Ілона Володимирівна,
        `,
        `
          Ідентиф.код  2750313661,
        `,
        `
          UA593052990000026001045005459,
        `,
        `
          АТ КБ "ПРИВАТБАНК"
        `,
        `
          Місце реєстрації : 08135 Україна, Київська область, Києво-Святошинський р-н,
        `,
        `
          вулиця Валерія Лобановського, будинок 26/1, квартира 89
        `,
        `
          e-mail  analytics.academy.2021@gmail.com
        `,
        `
          тел.: +38(050) 484 1268
        `,
      ];
    },
  },
  apollo: {
    language: gql`
      query {
        language
      }
    `,
  },
};
</script>
