<template>
  <b-container
    class="py-3"
    >
    <b-row>
      <b-col>
        <h2
          class="text-center mb-5"
          >
          {{ service_header }}
        </h2>
        <p
          v-for="service_paragraph in service_text.entries()"
          :key="service_paragraph[0]"
          >
          {{ service_paragraph[1] }}
        </p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
import gql from 'graphql-tag';

export default {
  data() {
    return {
      language: 'uk',
    };
  },
  computed: {
    service_header() {
      return this.language === 'ru' ? 'Наши услуги' : 'Наші послуги';
    },
    service_text() {
      return this.language === 'ru' ? [
        `
          Мы всегда готовы оказать Вам следующие услуги:
        `,
        `
          1. Провести аудит существующих отчетных систем, подготовить рекомендации по их совершенствованию, а также подготовить технические задания
        `,
        `
          2. Разработать и внедрить системы аналитической отчетности на базе Excel (PowerQuery и PowerPivot), PowerBI, а также OLAP-отчетов.
        `,
        `
          3. Провести тренинги по аналитическим инструментам (PowerQuery, PowerPivot, DAX, PowerBI), том числе мы готовы разработать тренинги конкретно для вашей Компании (на базе реальных данных вашей Компании)
        `,
        `
          4. Индивидуально подготовить аналитиков для вашей Компании.
        `,
        `
          5. Проконсультировать по любым вопросам, связанных с аналитикой данных.
        `,
        `
          6. Мы можем готовить аналитические отчеты для вашей Компании на постоянной основе с любой периодичностью
        `,
        `
          7. Бухгалтерского учет и консультации для ФОП
        `,
        `
          8. Бухгалтерский учёт для неприбыльных организаций
        `,
      ] : [
        `
          Ми завжди готові надати Вам такі послуги:
        `,
        `
          1. Провести аудит існуючих звітних систем, підготувати рекомендації щодо їх удосконалення, а також підготувати технічні завдання
        `,
        `
          2. Розробити та впровадити системи аналітичної звітності на базі Excel (PowerQuery та PowerPivot), PowerBI, а також OLAP-звітів.
        `,
        `
          3. Провести тренінги з аналітичних інструментів (PowerQuery, PowerPivot, DAX, PowerBI), у тому числі ми готові розробити тренінги конкретно для Вашої Компанії (на базі реальних даних Вашої Компанії)
        `,
        `
          4. Індивідуально підготувати аналітиків до Вашої Компанії.
        `,
        `
          5. Проконсультувати з будь-яких питань, пов'язаних із аналітикою даних.
        `,
        `
          6. Ми можемо готувати аналітичні звіти для Вашої Компанії на постійній основі з будь-якою періодичністю
        `,
        `
          7. Бухгалтерський облік та консультації для ФОП
        `,
        `
          8. Бухгалтерський облік для неприбуткових організацій
        `,
      ];
    },
  },
  apollo: {
    language: gql`
      query {
        language
      }
    `,
  },
};
</script>
